hotRoom/0/thermo:relHum
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      thermo:relHum;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.5;

boundaryField
{
    floor
    {
        type            zeroGradient;
        value           uniform 0;
    }

    ceiling
    {
        type            fixedValue;
        value           uniform 0.5;
    }

    fixedWalls
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
